Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/javacvs-omegat.tmx
Source language: en_us
Languages: pt_br

source: Un&ignore {0} files
pt_br: Não &ignorar {0} arquivos

source: Import &Message:
pt_br: &Mensagem de importação:

source: &Repository Folder:
pt_br: Pasta do &repositório:

source: CVS Root:
pt_br: Raiz do CVS:

source: <html><body>Projects with multiple roots can not be imported.<p>The project consists of:<p>{0}.
pt_br: <html><body>Projetos com múltiplas raízes não pode ser importada.<p>O projeto consiste de:<p>{0}.

source: [cannot HTML escape]
pt_br: [não pode escapar do HTML]

source: I&mport into Repository...
pt_br: I&mportar no repositório...

source: Import Project Options
pt_br: Opções do projeto de importação

source: [Enter CVS Repository]
pt_br: [Informar repositório CVS]

source: Local Folder:
pt_br: Pasta &local:

source: &Checkout After Import
pt_br: &Checkout depois da importação

source: Folder to &Import:
pt_br: Pasta à &importar:

source: Specify the local folder to import into CVS repository.
pt_br: Especificar a pasta local à importar dentro do repositório CVS.

source: Specify the repository folder to import the local folder into.
pt_br: Especificar a pasta do repositório à importar dentro da pasta local.

source: Folder to Import
pt_br: Pasta à importar

source: CVS Root
pt_br: Raiz do CVS

source: Cannot read CVS/Root
pt_br: Não pode ler CVS/Raíz

source: Cannot read CVS/Repository
pt_br: Não pode ler CVS/Repositório

source: Importing
pt_br: Importando

source: Preparing .cvsignore
pt_br: Preparando .cvsignore

source: Can not generate .cvsignore for unshareable files!
pt_br: Não pode gerar .cvsignore para arquivos que não podem ser compartilhados!

source: Folder must exist
pt_br: Pasta deve existir

source: Folder seems to be already versioned
pt_br: Pasta parece já estar versionada

source: Import message required
pt_br: Mensagem de importaçao requerida

source: Specify repository module
pt_br: Especificar módulo do repositório

source: Invalid repository module name
pt_br: Nome de módulo do repositório inválido

source: Bro&wse...
pt_br: Pro&curar...

source: Br&owse...
pt_br: Proc&urar...

source: Browse Folder to Import
pt_br: Procurar pasta à importar

source: Folders
pt_br: Pastas

source: Update Project with De&pendencies
pt_br: Atualizar projetos com de&pendências

source: Updating with Dependencies
pt_br: Atualizando com dependências

source: Preparing Update
pt_br: Preparando atualização

source: Browse for local folder to import into repository
pt_br: Procurar por pasta local à importar no repositório

source: Browse CVS repository for folder to import your files into
pt_br: Procurar repositório CVS para pasta à importar seus arquivos

source: Checks out imported files from repository after Import finishes.
pt_br: Verifica arquivos importados do repositório depois que a importação estiver finalizada.

source: This makes your local files versioned immediately without the need of an explicit checkout later.
pt_br: Isto faz seus arquivos locais versionados imediatemente sem a necessidade de um checkout explicito depois.

source: Local folder to import into repository.
pt_br: Pasta local à importar no repositório.

source: Path in CVS repository to import your files into
pt_br: Caminho no repositório CVS à importar seus arquivos

source: Message describing your import action.
pt_br: Mensagem que descreve sua ação de importação.

source: Lets you specify what local folder to import into what repository folder and give a descriptive message of your import.
pt_br: Permite especificar qual pasta local à importar em qual pasta do repositório e fornece uma mensagem descritiva da sua importação.

source: Can not copy CVS metadata
pt_br: Não pode copiar metadado do CVS

source: Show differences
pt_br: Exibir diferenças

source: Dif&f All Files
pt_br: Com&parar todos os arquivos

source: Diffing All Files
pt_br: Comparando todos os arquivos

source: &Diff Files
pt_br: &Comparar arquivos

source: &Diff {0} Projects
pt_br: &Comparar {0} projetos

source: Diffing
pt_br: Comparando

source: Diffing "{0}"
pt_br: Comparando "{0}"

source: Diffing Files
pt_br: Comparando arquivos

source: Diffing {0} Projects
pt_br: Comparando {0} projetos

source: E&xport Diff Patch...
pt_br: E&xportar patch de comparação

source: E&xport Files Diff Patch...
pt_br: E&xpotar patch de comparação de arquivos...

source: E&xport {0} Projects Diff Patch...
pt_br: E&xpotar patch de comparação de {0} projetos...

source: Exporting Diff Patch
pt_br: Exportando patch de comparação

source: Exporting "{0}" Diff Patch
pt_br: Exportando patch de comparação "{0}"

source: Exporting Files Diff Patch
pt_br: Exporatndo patch de comparação de arquivos

source: Exporting {0} Projects Diff Patch
pt_br: Exportando patch de comparação de {0} projetos

source: In selected context there is nothing to export!
pt_br: No contexto selecionado não há nada à exportar!

source: Patch Files (*.diff, *.patch)
pt_br: Arquivos Patch (*.diff, *.patch)

source: Diff patch export failed!
pt_br: Exportação de patch de comparação falhou!

source: Diff patch exported {0} diffs.
pt_br: Exportado {0} comparações de patch de comparação.

source: Replace existing {0} file?.
pt_br: Substituir arquivo {0} existente?

source: Diff All Files
pt_br: Comparar todos os arquivos

source: Resol&ve Conflicts...
pt_br: Resol&ver conflitos...

source: Resol&ve Conflicts in Files...
pt_br: Resol&ver conflitos nos arquivos...

source: Current ({0} based)
pt_br: Atual ({0} baseado)

source: Diff
pt_br: Comparar

source: {0} [ Diff ]
pt_br: {0} [ Comparar ]

source: <Fetching files from repository.
pt_br: <Recuperando arquivos do repositório.

source: Please wait ...>
pt_br: Aguarde...

source: <No File Selected>
pt_br: <Nenhum arquivo selecionado>

source: Show locally modified files
pt_br: Exibir arquivos modificados localmente

source: Remote
pt_br: Remoto

source: Show remotely modified files
pt_br: Exibir arquivos modificados remotamente

source: Remote vs Local
pt_br: Remoto vs Local

source: Show both locally and remotely modified files
pt_br: Exibir arquivos locais e remotos modificados

source: Go to next difference
pt_br: Ir para próxima diferença

source: Go to previous difference
pt_br: Ir para diferença anterior

source: [Binary File {0}]
pt_br: [Arquivo binário {0}]

source: No Base Revision
pt_br: Nenhuma revisão de base

source: Remotely Modified (Based On {0})
pt_br: Modificado remotamente (baseado em {0})

source: Locally Modified (Based On {0})
pt_br: Modificado localmente (baseado em {0})

source: Local Conflict (Based On {0})
pt_br: Conflito local (baseado em {0})

source: <No local changes>
pt_br: <Sem alterações locais>

source: <No remote changes>
pt_br: <Sem alterações remotas>

source: <No local or remote changes>
pt_br: <Sem alterações locais ou remotas>

source: No conflicts found in file.
pt_br: Nenhum conflito encontrado no arquivo.

source: Local Working File
pt_br: Arquivo de trabalho local

source: Remote file
pt_br: Arquivo remoto

source: Result after merge
pt_br: Resultado depois de mesclagem

source: No conflicts found in files.
pt_br: Nenhum conflito encontrado nos arquivos.

source: File "{0}" is marked as Local Conflict because it cannot be updated from repository.
pt_br: Arquivo "{0}" está marcado com conflito local por quê não pode ser atualizado do repositório.

source: File on disk is unknown to CVS and some other file with the same name exists in repository.
pt_br: Arquivo no disco é desconhecido do CVS e alguns outros arquivos com o mesmo nome existem no repositório.

source: You should delete "{0}" or move it away from current location and then run Update again.
pt_br: Você deve excluir "{0}" ou mover da localização atual e então executar Atualizar novamente.

source: Refresh Diff
pt_br: Atualizar comparação

source: Update "{0}"
pt_br: Atualizar "{0}"

source: Commit "{0}"
pt_br: Submeter "{0}"

source: Refreshing CVS Status
pt_br: Atualizando status no CVS

source: Export Diff Patch
pt_br: Exportar patch de comparação

source: Lets you choose name and location of exported path file.
pt_br: Permite escolher o nome e localização do arquivo exportado.

source: Export
pt_br: Expotar

source: Versioning status of the resource
pt_br: Situação do versionamento do recurso

source: Repository location of the resource
pt_br: Localização do repositório do recurso

source: Diff view
pt_br: Visualizar comparação

source: Shows lists of files that have changed
pt_br: Exibe lista de arquivos que foram alterados

source: &Tag Files...
pt_br: Arquivos de &marcação...

source: &Tag {0} Projects...
pt_br: Projeto {0} de &marcação...

source: Tagging
pt_br: Marcando

source: Tagging "{0}"...
pt_br: Marcando "{0}"...

source: Tagging Files...
pt_br: Marcando arquivos...

source: Tagging {0} Projects...
pt_br: Marcando {0} projetos...

source: &Branch Files...
pt_br: Arquivos &branch...

source: &Branch {0} Projects...
pt_br: Projetos {0} &Branch...

source: Branching Files
pt_br: Branching de arquivos

source: Branching {0} Projects
pt_br: Branching {0} de projetos

source: &Merge Changes from Branch...
pt_br: Mesclar alterações a par&tir do branch...

source: Merging Changes from Branch
pt_br: Mesclando alterações do branch

source: &Switch to Branch...
pt_br: Alte&rnar para o branch...

source: &Switch Files to Branch...
pt_br: Alternar arquivo&s para o branch...

source: &Switch {0} Projects to Branch...
pt_br: Alternar {0} projeto&s para o branch...

source: Switching to Branch
pt_br: Alternando para o branch

source: Switching "{0}" to Branch
pt_br: Mudando "{0}" para o branch

source: Switching Files to Branch
pt_br: Mudando arquivos para branch

source: Switching {0} Projects to Branch
pt_br: Mudando projetos {0} para o branch

source: This dialog lets you specify the name of the tag and options related to tagging.
pt_br: Esta caixa de diálogo permite especificar o nome da marcação e opções relacionadas à marcação.

source: Tag - {0}
pt_br: Marcação - {0}

source: &Tag name:
pt_br: Nome &da marcação:

source: &Avoid Tagging Locally Modified Files
pt_br: &Evitar marcação de arquivos modificados localmente

source: CVS makes sure that your working directory does not contain any locally modified files before tagging
pt_br: CVS assegura que seu diretório de trabalho não contém qualquer arquivo modificado localmente antes de iniciar a marcação.

source: &Move Existing Tag
pt_br: &Mover marcação existente

source: If the tag already exists it will be moved to tag current revisions of files in your working directory
pt_br: Se a marcação já existe será movida para a revisão atual da marcação de arquivos em seu diretório de trabalho.

source: Tag
pt_br: Marcação

source: &Delete Tag
pt_br: &Excluir marcação

source: Deletes the tag
pt_br: Exclui a marcação

source: Confirm settings and tag
pt_br: Confirmar configurações e marcação

source: Browse for tag from list of existing tags.
pt_br: Procurar por marcação da lista de marcações existentes.

source: Tagging {0}
pt_br: Marcando {0}

source: There is nothing to branch!
pt_br: Não há nada para o branch!

source: This dialog lets you specify detailed settings for creating a new branch such as the name of the new branch or whether to tag the root of the branch.
pt_br: Esta caixa de diálogo permite especificar configurações detalhadas para criação de um novo branch como o nome do novo branch ou se marcar a raiz do branch.

source: You can also instruct Netbeans to switch your sources to this branch after branching completes.
pt_br: Você também pode instruir o Netbeans à mudar seus fontes para este branch depois do "branching" completo.

source: Confirm settings and branch
pt_br: Confirmar configurações e branch

source: &Branch Name:
pt_br: Nome do &branch:

source: &Switch to This Branch Afterwards
pt_br: Mudar para e&ste branch depois

source: Updates working directory to newly created branch
pt_br: Atualizar o diretório de trabalho para o branch mais novo criado

source: Browse for branch name in list of all branches
pt_br: Procurar por nome do branch na lista de todos branches

source: &Tag Before Branching
pt_br: Marcar an&tes do branching

source: Tag root of the branch for future reference
pt_br: Marcação raiz do branch para referência futura

source: Tag &Name:
pt_br: &Nome da marcação:

source: Name of the tag that will be used to tag the root of the branch
pt_br: Nome da marcação que será utilizada para marcar a raiz do branch

source: Branche Name
pt_br: Nome da marcação

source: Specify the Branche Name you want to switch to
pt_br: Especificar o nome do branche que você deseja alternar

source: Specify the Tag Name which has to be set after branching
pt_br: Especificar o nome da marcação que deve ser ajustada depois do branching

source: This dialog lets you specify to which branch you want to switch to.
pt_br: Esta caixa de diálogo leva você a especificar para qual branch você deseja mudar.

source: Switch to Branch - {0}
pt_br: Mudar para Branch - {0}

source: Switch
pt_br: Alternar

source: Confirm dialog and switch to branch
pt_br: Caixa de diálogo de confirmação e mudança para branch

source: Switch to &Trunk
pt_br: Mudar para &trunk

source: Switch your working files to trunk
pt_br: &Mudar seus arquivos de trabalho para o trunk...

source: Switch to &Branch:
pt_br: Mudar para o &branch:

source: Switch your working files to an existing branch
pt_br: Mudar seus arquivos de trabalho para um branch existente

source: Browse for branch name to switch to in list of all branches
pt_br: Procurar por nome de branch para mudar na lista de todos branches

source: Name of the branch to switch to
pt_br: Nome do branch a ser alternado

source: Lets you specify settings for merging changes from one branch to another.
pt_br: Permite especificar configurações para alterações mescladas de um branch para outro.

source: Merge Changes from Branch - {0}
pt_br: Mesclar alterações do branch - {0}

source: Merge
pt_br: Mesclar

source: Confirm dialog and merge
pt_br: Caixa de diálogo de confirmação e mesclagem

source: Cancel merge
pt_br: Cancelar mesclagem

source: The current branch of your working directory.
pt_br: O branch atual do seu diretório de trabalho.

source: It is the destination for changes you will be merging.
pt_br: Este é o destino para alterações que você estará mesclando.

source: Merge from &Trunk
pt_br: Mesclar de um &trunk

source: Merge changes that were made in trunk into your working directory
pt_br: Mesclar alterações que foram feitas no trunk do seu diretório de trabalho

source: Merge from &Branch
pt_br: Mesclar do &branch

source: Merge changes that were made in a branch other than trunk into your working directory
pt_br: Mesclar alterações que foram feitas em um outro branch à exceção do trunk do seu diretório de trabalho.

source: Name of the branch to merge from
pt_br: Nome do branch à mesclar

source: Browse for source branch name in list of all branches
pt_br: Procurar por nome de branch da fonte na lista de todos branches

source: &Merge Only Changes Made after Tag
pt_br: &Mesclar somente alterações feitas depois da marcação

source: Only changes that were made after this tag will be merged into you working directory
pt_br: Somente alterações que foram feitas depois que esta marcação for mesclada no seu diretório de trabalho

source: Browse for tag that marks start of changes you want to merge
pt_br: Procurar por marcação que marca o início das alterações que você deseja mesclar

source: Tag Nam&e:
pt_br: Nom&e da marcação

source: Tag &after Merge
pt_br: M&arcação depois de mesclar

source: Tag the source branch after merging to mark changes you have already merged
pt_br: Marca o branch da fonte depois que a mesclagem marcar alterações que você já mesclou

source: Browse for name of the tag that will be used to tag the source branch after merging
pt_br: Procura pelo nome da marcação que será utilizado para marcar o branch de origem depois de mesclar

source: Tag Trunk after Merge
pt_br: Marcação Trunk depois de mesclar

source: Tag "{0}" Branch after Merge
pt_br: Marcação "{0}" do branch depois de mesclar

source: Name of an existing tag that marks start of changes you want to merge
pt_br: Nome de uma marcação existente que marca o início das alterações que você deseja mesclar

source: Name of a new or existing tag that will be used to tag the head of source branch
pt_br: Nome de uma marcação nova ou existente que você utilizará para marcar o cabeçalho do branch de origem

source: Brow&se...
pt_br: Proc&urar...

source: {0} folders
pt_br: {0} pastas

source: &Merge Changes Into Working Branch:
pt_br: &Mesclar alterações no branch de trabalho:

source: &Starting From:
pt_br: &Iniciando de:

source: &Until:
pt_br: &Até:

source: Tag Na&me:
pt_br: No&me da marcação:

source: Ta&g "name" Branch After Merge
pt_br: Marc&ação "name" do branch depois de mesclar

source: Br&anching Point / Branch Root
pt_br: Ponto Br&anching / Raiz branch

source: &Tag / Revision:
pt_br: &Marcação / Revisão:

source: Tru&nk HEAD
pt_br: HEAD do Tru&nk

source: Bran&ch Head:
pt_br: Head do Bran&ch:

source: Tag / R&evision:
pt_br: Marcação / R&evisão:

source: Name of the tag
pt_br: Nome da marcação

source: &Use System Proxy Settings
pt_br: &Utilizar configurações de proxy do sistema

source: H&TTP Proxy
pt_br: Proxy H&TTP

source: &SOCKS Proxy
pt_br: Proxy &SOCKS

source: P&roxy Host:
pt_br: Servidor P&roxy:

source: P&ort:
pt_br: P&orta:

source: Proxy Server Requires &Login
pt_br: Servidor Proxy requer &login

source: Na&me:
pt_br: No&me:

source: &Password:
pt_br: &Senha:

source: &No Proxy (direct connection)
pt_br: &Sem proxy (conexão direta)

source: Can not access:
pt_br: Não pode acessar:

source: Used NetBeans HTTP proxy
pt_br: Proxy HTTP do NetBeans utilizado

source: Detected KDE HTTP proxy
pt_br: Proxy HTTP KDE detectado

source: Detected direct connection
pt_br: Conexão direta detectada

source: Proxy Configuration
pt_br: Configuração do Proxy

source: Check if the proxy server requires authentication
pt_br: Verifica se o servidor proxy requer autenticação

source: TCP/IP port number of the proxy server
pt_br: Número da porta TCP/IP do servidor proxy

source: TCP/IP host name of the proxy server
pt_br: Nome da máquina TCP/IP do servidor proxy

source: Use proxy settings defined in IDE or use operating system settings
pt_br: Utilizar configurações do proxy definidas no IDE ou utilizar configurações do sistema operacional

source: Connect directly to server
pt_br: Conectar diretamente ao servidor

source: Connect via HTTP proxy
pt_br: Conectar via proxy HTTP

source: Connect via SOCKS 4 or SOCKS 5 proxy
pt_br: Conectar via proxy SOCKS 4 ou SOCKS 5

source: Username for authentication on proxy server
pt_br: Nome de usuário para autenticação no servidor proxy

source: Password for authentication on proxy server
pt_br: Senha para autenticação no servidor proxy

source: This dialog lets you specify network connection parameters to use when connection to a given CVS server.
pt_br: Esta caixa de diálogo permite que você especifique os parametros de conexão da rede para utilizar quando conectado à um servidor CVS.

source: Possible options include: HTTP proxy, SOCKS proxy, direct connection or system default.
pt_br: Opções possíveis incluem: proxy HTTP, proxy SOCKS, conexão direta ou padrão do sistema.

source: Aliases
pt_br: Apelidos

source: Loading...
pt_br: Carregando...

source: Error
pt_br: Erro

source: Nothing has been found.
pt_br: Nada foi encontrado.

source: Browse Tags
pt_br: Procurar marcações

source: &Branches and Tags:
pt_br: &Branches e marcações:

source: Can not create temporary folder
pt_br: Não pode criar pasta temporária

source: Can not list CVS tags.
pt_br: Não pode listar marcações do CVS.

source: Lets you browse for name of a branch in list of all available branches.
pt_br: Permite você procurar por nome de um branch na lista de todos branches disponíveis.

source: Branch browser
pt_br: Navegador de Branch

source: List of all available branches
pt_br: Lista de todos branches disponíveis

source: Can not create temporary folder.
pt_br: Não pode criar pasta temporária.

source: Browse CVS Module
pt_br: Procurar módulo CVS

source: &Repository Contents:
pt_br: Conteúdo do &repositório:

source: Browse Repository Folder
pt_br: Procurar pasta do repositório

source: Lets you browse for modules in list of all modules in repository.
pt_br: Permite você procurar por módulos na lista de todos módulos no repositório.

source: Module browser
pt_br: Navegador de módulo

source: List of all modules in the repository
pt_br: LIsta de todos módulos no repositório

source: <html>Specify location of CVS repository defined by CVS root.
pt_br: <html>Entre com a localização do repositório CVS definido pela raiz do CVS.

source: CVS &Root:
pt_br: &Raiz do CVS:

source: Proxy &Configuration...
pt_br: &Configuração de Proxy...

source: Browse Local Folder
pt_br: Procurar pasta local

source: Only :pserver:, :local:, :ext: and :fork: connection methods supported.
pt_br: Somente métodos de conexão suportados :pserver:, :local:, :ext: e :fork:.

source: Cannot connect to: {0}
pt_br: Impossível conectar: {0}

source: Please check username, password and repository.
pt_br: Verifique o nome de usuário, senha e repositório.

source: Cannot access specified repository.
pt_br: Impossível acessar o repositório especificado.

source: <html>Specify the CVS module and branch to checkout from CVS repository.
pt_br: <html>Entre com o módulo e branch do CVS o qual deva ser obtido a partir do repositório CVS.

source: &Module:
pt_br: &Módulo:

source: (empty means all modules)
pt_br: (vazio significa todos os módulos)

source: Specify location of local folder to checkout module into.
pt_br: Define a pasta local onde o módulo obtido será copiado.

source: &Local Folder:
pt_br: Pasta &local:

source: (local CVS working directory)
pt_br: (diretório de trabalho local do CVS)

source: Module to Checkout
pt_br: Módulo a ser obtido

source: Authentication in progress
pt_br: Autenticação em progresso

source: Checking network connection
pt_br: Verificando conexão de rede

source: Connecting CVS Server
pt_br: Conectando ao servidor CVS

source: Use internal SSH
pt_br: Utilizar SSH interno

source: Re&member Password
pt_br: L&embrar senha

source: &Shell Command:
pt_br: Comando &shell:

source: <html><body>IDE directly supports following CVS root types:<dl><dt><tt>:pserver:username@hostname:/repository_path</tt></dt><dd>for connecting to CVS pserver repositories</dd><dt><tt>:ext:username@hostname:/repository_path</tt></dt><dd>for connecting CVS repository using SSH, etc.</dd></dl><p>Following types require external <tt>cvs</tt> program:<dl><dt><tt>:fork:/repository_path</tt></dt><dd>for protocol access to local CVS repository</dd><dt><tt>:local:/repository_path</tt></dt><dd>for direct access to local CVS repository</dd><dl></body></html>
pt_br: <html><body>O IDE suporta os seguintes tipos de raízes CVS:<dl><dt><tt>:pserver:username@hostname:/repository_path</tt></dt><dd>para conexão à repositórios CVS pserver</dd><dt><tt>:ext:username@hostname:/repository_path</tt></dt><dd>para conectar ao CVS utilizando SSH, etc.</dd></dl><p>Os seguintes tipos requerem programas <tt>cvs</tt> externos:<dl><dt><tt>:fork:/repository_path</tt></dt><dd>para protocolo de acesso ao repositório CVS local</dd><dt><tt>:local:/repository_path</tt></dt><dd>para acesso direto ao repositório CVS local</dd><dl></body></html>

source: E&dit...
pt_br: E&ditar...

source: Use &Internal SSH
pt_br: Utilizar SSH &interno

source: Use &External Shell
pt_br: Utilizar shell &externo

source: &Repository Path:
pt_br: Caminho do &repositório:

source: &Access Method:
pt_br: Método de &acesso:

source: &User:
pt_br: &Usuário:

source: H&ost:
pt_br: Máquin&a:

source: &Port:
pt_br: &Porta:
